content/posts/weekly-summary-2023-04-09.en.md
+++
title = "Weekly Summary 2023-04-09"
date = 2023-04-16T15:10:00+10:00
lastmod = 2023-04-16T15:12:08+10:00
draft = false
weight = 2001
featuredImage = "/ox-hugo/weekly-summary-2023-04-09-cover.jpeg"
+++

I've decided to start documenting my weekly life by providing a brief summary of what I've read, watched, and done in the past week.

<!--more-->

[中文版](https://chaoruan.xyz/zh-cn/posts/weekly-summary-2023-04-09)


## What I Read {#what-i-read}


### [I worked at Google for -10 days](https://andgein.ru/blog/all/20-i-worked-at-google-for-10-days/) {#i-worked-at-google-for-10-days}

This Blog post takes me back to when I landed my first job in the US in March 2020. Shortly after selling my house and moving all my possessions to the US, the COVID-19 pandemic struck. My wife and I found ourselves using Airbnb, and the mounting uncertainty left me concerned about the possibility of being laid off. Fun time!


### [Replacing my best friends with an LLM trained on 500,000 group chat messages](https://www.izzy.co/blogs/robo-boys.html) {#replacing-my-best-friends-with-an-llm-trained-on-500-000-group-chat-messages}

Its like that episode of Black Mirror now - [Be Right Back](https://www.imdb.com/title/tt2290780/)


### [Ask HN: What are some of the best university courses available online for free?](https://news.ycombinator.com/item?id=35536042) {#ask-hn-what-are-some-of-the-best-university-courses-available-online-for-free}

Perhaps one day, I'll go through the list here, find a class that interests me, and begin learning once more.


### [Mass Layoffs and Absentee Bosses Create a Morale Crisis at Meta](https://www.nytimes.com/2023/04/12/technology/meta-layoffs-employees-management.html) {#mass-layoffs-and-absentee-bosses-create-a-morale-crisis-at-meta}

We're all aware that Meta isn't as great as it once was. With the unrealistic version of the metaverse and the ongoing layoffs, it seems that nobody knows what the future holds for Meta, at least for the time being.


### [everythingishacked/Semaphore: A full-body keyboard using gestures to type through computer vision](https://github.com/everythingishacked/Semaphore) {#everythingishacked-semaphore-a-full-body-keyboard-using-gestures-to-type-through-computer-vision}

I'm pretty sure that if I use this for programming, I'll lose weight fairly quickly.


### [916 days of Emacs](https://sqrtminusone.xyz/posts/2023-04-13-emacs/) {#916-days-of-emacs}

I always enjoy hearing about people's Emacs experiences, but this one is truly next level. I appreciate all the charts illustrating the time and data the author spent in different areas. As usual, if you want to spark a lot of replies on Hacker News, just mention Vim or Emacs!


### [Do you actually need a vector database?](https://www.ethanrosenthal.com/2023/04/10/nn-vs-ann/) {#do-you-actually-need-a-vector-database}

Vector databases are quite popular nowadays, but whether you need one depends on your specific use case. It seems that having a vector database is essential if you plan to work with machine learning or large language models.


### [What you give up when moving into engineering management](https://stackoverflow.blog/2022/02/23/what-you-give-up-when-moving-into-engineering-management/) {#what-you-give-up-when-moving-into-engineering-management}

This prompts me to reflect on my true aspirations as an engineer. I'm interested in the hybrid roles mentioned later in the post, perhaps as a tech lead. But I wonder how that would work in a remote position. I'm not yet convinced that managing a team of engineers remotely is entirely feasible.


### [Don’t start a business until people are asking you to](https://sive.rs/asking) {#don-t-start-a-business-until-people-are-asking-you-to}

It's a one-minute read, but I genuinely appreciate the points the author makes here.

> Don’t announce anything. Don’t choose a name. Don’t make a website or an app. Don’t build a system. You need to be free to completely change or ditch your idea.
> Then you get your first paying customer. Provide a one-on-one personal service. Then you get another paying customer. Prove a real demand.


## What I Watched {#what-i-watched}


### [$3K/month PASSIVE INCOME—full strategy for Shutterstock](https://www.youtube.com/watch?v=VpnXyal5HJg) {#3k-month-passive-income-full-strategy-for-shutterstock}

I'm eager to start generating passive income, and a YouTube video introduced me to the concept of stock video creation. Although I've never tried it before, it might be a fun endeavor to explore.

> Stock footage, also known as stock video or B-roll, is pre-filmed footage that can be purchased and used in a variety of projects and films. Stock footage can be licensed and saves filmmakers the time and money of shooting original material.

[Stock Video Guide - What is Stock Footage and How to Use It | iStock](https://marketing.istockphoto.com/blog/complete-guide-to-stock-video/)


### [The Legend of Zelda: Tears of the Kingdom – Official Trailer](https://www.youtube.com/watch?v=uHGShqcAHlQ&t=2s) {#the-legend-of-zelda-tears-of-the-kingdom-official-trailer}

I can't wait any longer, and I'm pretty sure I'll take a day off on the launch day.


## What I Did {#what-i-did}


### [Keychron Q2 Customizable Mechanical Keyboard](https://www.keychron.com/pages/keychron-q2-customizable-mechanical-keyboard) {#keychron-q2-customizable-mechanical-keyboard}

I purchased this new keyboard as upgrade and am thoroughly enjoying typing each individual character.
